# HasAssociatedParts Method (Document, LinkElementId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils..::..HasAssociatedParts Method (Document, LinkElementId)
PartUtils Class See Also
---
Checks if an element has associated parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool HasAssociatedParts(
	Document hostDocument,
	LinkElementId hostOrLinkElementId
)
```

Visual Basic
---
```text
Public Shared Function HasAssociatedParts ( _
	hostDocument As Document, _
	hostOrLinkElementId As LinkElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool HasAssociatedParts(
	Document^ hostDocument,
	LinkElementId^ hostOrLinkElementId
)
```

# ### Parameters
hostDocument
    Type: Autodesk.Revit.DB..::..Document The document.
hostOrLinkElementId
    Type: Autodesk.Revit.DB..::..LinkElementId The element to be checked for associated Parts.
# ### Return Value
True if the element has associated Parts.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartUtils Class
HasAssociatedParts Overload
Autodesk.Revit.DB Namespace